In [5]:
import numpy as np
import pandas as pd

In [7]:
df=pd.DataFrame([[10,15,11,12],
              [45,66,23,14],
              [22,33,44,55],
              [78,88,96,45]],
             columns=['oas','java','se','ds'])
df

   oas  java  se  ds
0   10    15  11  12
1   45    66  23  14
2   22    33  44  55
3   78    88  96  45

In [9]:
df.describe()

             oas       java        se         ds
count   4.000000   4.000000   4.00000   4.000000
mean   38.750000  50.500000  43.50000  31.500000
std    29.926298  32.726136  37.56328  21.763884
min    10.000000  15.000000  11.00000  12.000000
25%    19.000000  28.500000  20.00000  13.500000
50%    33.500000  49.500000  33.50000  29.500000
75%    53.250000  71.500000  57.00000  47.500000
max    78.000000  88.000000  96.00000  55.000000

In [10]:
df.sum()

oas     155
java    202
se      174
ds      126
dtype: int64

In [11]:
df.max()

oas     78
java    88
se      96
ds      55
dtype: int64

In [12]:
df.min()

oas     10
java    15
se      11
ds      12
dtype: int64

In [13]:
df.mean()

oas     38.75
java    50.50
se      43.50
ds      31.50
dtype: float64

In [14]:
df.count()

oas     4
java    4
se      4
ds      4
dtype: int64

In [15]:
df.median()

oas     33.5
java    49.5
se      33.5
ds      29.5
dtype: float64

In [16]:
df.agg(['sum','min','max'])

     oas  java   se   ds
sum  155   202  174  126
min   10    15   11   12
max   78    88   96   55

In [30]:
df1=pd.DataFrame(
    [
        ['Akash','Torvi','Full-Time','administraction',2,20000],
        ['Harshad','Walikar','Full-Time','Technical',4,30000],
        ['Rahul','B','Full-Time','administraction',2,40000],
        ['Abhinav','nai','Full-Time','administraction',6,50000],
        ['Gurya','Biradar','intern','administraction',2,20000],
    ],columns=['Frist name','Last name','Type','Department','YOE','Salary']



    )
df1

  Frist name Last name       Type       Department  YOE  Salary
0      Akash     Torvi  Full-Time  administraction    2   20000
1    Harshad   Walikar  Full-Time        Technical    4   30000
2      Rahul         B  Full-Time  administraction    2   40000
3    Abhinav       nai  Full-Time  administraction    6   50000
4      Gurya   Biradar     intern  administraction    2   20000

In [31]:
df1.groupby(['Type']).sum()

           YOE  Salary
Type
Full-Time   14  140000
intern       2   20000

In [33]:
df1.groupby(['Type','Department']).mean()

                                YOE        Salary
Type      Department
Full-Time Technical        4.000000  30000.000000
          administraction  3.333333  36666.666667
intern    administraction  2.000000  20000.000000